# titanic dataset used train and test.csv

# Training the model -

Import packages

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from sklearn import tree
from sklearn import preprocessing

Loading the dataset file

In [4]:
titanic_train=pd.read_csv("train.csv")

Reading the dataset in jupyter

In [5]:
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
885,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
886,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,45.0,1,2,W./C. 6607,23.4500,NaN,S
887,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
888,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Using describe functions for necessary measure like mean, std

In [6]:
titanic_train.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,889.0,446.000000,256.998173,1.00,224.0000,446.0000,668.0,891.0000
Survived,889.0,0.382452,0.486260,0.00,0.0000,0.0000,1.0,1.0000
Pclass,889.0,2.311586,0.834700,1.00,2.0000,3.0000,3.0,3.0000
Age,889.0,32.699854,14.346821,0.42,22.0000,32.0000,45.0,80.0000
SibSp,889.0,0.524184,1.103705,0.00,0.0000,0.0000,1.0,8.0000
Parch,889.0,0.382452,0.806761,0.00,0.0000,0.0000,0.0,6.0000
Fare,889.0,32.096681,49.697504,0.00,7.8958,14.4542,31.0,512.3292

Changing null value to mean value

In [7]:
new_age=np.where(titanic_train["Age"].isnull,32,titanic_train["Age"])

In [8]:
titanic_train["Age"]=new_age

Transformation for string into binary format

In [9]:
label_encoder=preprocessing.LabelEncoder()

In [10]:
encoded_sex=label_encoder.fit_transform(titanic_train["Sex"])

Loading the independent variable into dataframe

In [11]:
predictors=pd.DataFrame([encoded_sex,titanic_train["Age"],titanic_train["Fare"]]).T

Using algorithm from sklearn package

In [12]:
tree_model=tree.DecisionTreeClassifier()

Creating model with help of algorithm and putting our DV and IDV into fit()functions : X as IDV and y as DV

In [13]:
tree_model.fit(X=predictors,y=titanic_train["Survived"])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

Creating .dot file of decision Tree and http://www.webgraphviz.com/ put the code in here then tree sturcture formed

In [14]:
with open("Dtree1.dot","w") as f:
    f=tree.export_graphviz(tree_model,feature_names=["Sex","Age","Fare"],out_file=f)

Accuracy of Model

In [15]:
tree_model.score(X=predictors,y=titanic_train["Survived"])

0.9021372328458943

# Testing the model -

In [16]:
titanic_test=pd.read_csv("test.csv")

In [17]:
titanic_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...
412,1305,3,"Spector, Mr. Woolf",male,45.0,0,0,A.5. 3236,8.0500,S
413,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C
414,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S
415,1308,3,"Ware, Mr. Frederick",male,45.0,0,0,359309,8.0500,S
416,1309,3,"Peter, Master. Michael J",male,45.0,1,1,2668,22.3583,C

In [18]:
titanic_test.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,417.0,1100.635492,120.923774,892.00,996.0000,1101.0000,1205.0,1309.0000
Pclass,417.0,2.263789,0.842077,1.00,1.0000,3.0000,3.0,3.0000
Age,417.0,33.237410,13.922884,0.17,23.0000,32.0000,45.0,76.0000
SibSp,417.0,0.448441,0.897568,0.00,0.0000,0.0000,1.0,8.0000
Parch,417.0,0.393285,0.982419,0.00,0.0000,0.0000,0.0,9.0000
Fare,417.0,35.627188,55.907576,0.00,7.8958,14.4542,31.5,512.3292

In [19]:
new_age_test=np.where(titanic_test["Age"].isnull,33,titanic_test["Age"])

In [20]:
titanic_test["Age"]=new_age_test

In [21]:
label_encoder_test=preprocessing.LabelEncoder()

In [31]:
encoded_sex_test=label_encoder_test.fit_transform(titanic_test["Sex"])

In [32]:
test_feature=pd.DataFrame([encoded_sex_test,titanic_test["Age"],titanic_test["Fare"]]).T

Using model for loading the predictions with IDV

In [33]:
test_pred=tree_model.predict(X=test_feature)

prediction using dataframe which consists of unique Identifier + DV+IDV

In [34]:
predicted_output=pd.DataFrame({"PassengerId":titanic_test["PassengerId"],"Survived":test_pred})

Generating the .csv file for predictions data

In [35]:
predicted_output.to_csv("Output.csv",index=False)

for reading the output file

In [36]:
output_read=pd.read_csv("Output.csv")
output_read

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
412         1305         0
413         1306         1
414         1307         0
415         1308         0
416         1309         0

[417 rows x 2 columns]

# Rules of Decision Tree

1)